Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.rds.aws_db_instance.rds has been changed
~ resource "aws_db_instance" "rds" {
        id                                    = "comentarios-api-production-rds01"
      ~ latest_restorable_time                = "2021-08-09T05:55:00Z" -> "2021-08-09T06:20:00Z"
        name                                  = ""
        tags                                  = {
            "Environment" = "production"
            "Name"        = "comentarios-api-production-rds01"
            "Project"     = "comentarios-api"
        }
        # (55 unchanged attributes hidden)
    }
  # aws_lambda_function.main has been changed
~ resource "aws_lambda_function" "main" {
        id                             = "comentarios-api"
      ~ last_modified                  = "2021-08-09T05:58:49.910+0000" -> "2021-08-09T06:04:24.548+0000"
      + layers                         = []
      ~ source_code_hash               = "7A8ZwRmcWCOwdhjqP6tgMQMQmIGe+wS74lDWPYo/HCM=" -> "i1aN+88ZNn91MEycPiDKJQLxq+cpcRX9JE5o/Ylg9bw="
      + tags                           = {}
        # (17 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }
  # aws_api_gateway_integration.integration has been changed
~ resource "aws_api_gateway_integration" "integration" {
      + cache_key_parameters    = []
        id                      = "agi-n1fiynim17-eqioip-GET"
      + request_parameters      = {}
      + request_templates       = {}
        # (10 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_security_group_rule.lambda-out will be created
+ resource "aws_security_group_rule" "lambda-out" {
      + from_port                = 3306
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-0b8d7fbd67590ac85"
      + self                     = false
      + source_security_group_id = "sg-09b0faa61bf615a6f"
      + to_port                  = 3306
      + type                     = "egress"
    }

  # module.db_provisioner.data.aws_lambda_invocation.default[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_lambda_invocation" "default"  {
      + function_name = "prod-prod-comentarios-api-db-provisioner-db-provisioner"
      + id            = (known after apply)
      + result        = (known after apply)
    }

  # module.db_provisioner.aws_cloudwatch_log_group.lambda[0] will be created
+ resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/prod-prod-comentarios-api-db-provisioner-db-provisioner"
      + retention_in_days = 0
      + tags              = {
          + "Attributes" = "db-provisioner"
          + "Name"       = "prod-prod-comentarios-api-db-provisioner-db-provisioner"
          + "Namespace"  = "prod"
          + "Stage"      = "prod"
        }
      + tags_all          = {
          + "Attributes" = "db-provisioner"
          + "Name"       = "prod-prod-comentarios-api-db-provisioner-db-provisioner"
          + "Namespace"  = "prod"
          + "Stage"      = "prod"
        }
    }

  # module.db_provisioner.aws_iam_policy.default[0] will be created
+ resource "aws_iam_policy" "default" {
      + arn         = (known after apply)
      + description = "IAM policy to control access of Lambda function to AWS resources"
      + id          = (known after apply)
      + name        = "prod-prod-comentarios-api-db-provisioner-db-provisioner"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "rds:DescribeDBInstances"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = "ssm:GetParameter"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ssm:us-east-2:107815129133:parameter/mysql/password"
                      + Sid      = ""
                    },
                  + {
                      + Action   = "kms:Decrypt"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:kms:us-east-2:107815129133:key/792cdc9f-ab9d-4975-9f73-1d56b4182590"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.db_provisioner.aws_iam_role.lambda[0] will be created
+ resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "prod-prod-comentarios-api-db-provisioner-db-provisioner"
      + path                  = "/"
      + tags                  = {
          + "Attributes" = "db-provisioner"
          + "Name"       = "prod-prod-comentarios-api-db-provisioner-db-provisioner"
          + "Namespace"  = "prod"
          + "Stage"      = "prod"
        }
      + tags_all              = {
          + "Attributes" = "db-provisioner"
          + "Name"       = "prod-prod-comentarios-api-db-provisioner-db-provisioner"
          + "Namespace"  = "prod"
          + "Stage"      = "prod"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.db_provisioner.aws_iam_role_policy_attachment.basic_execution[0] will be created
+ resource "aws_iam_role_policy_attachment" "basic_execution" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "prod-prod-comentarios-api-db-provisioner-db-provisioner"
    }

  # module.db_provisioner.aws_iam_role_policy_attachment.default_permissions[0] will be created
+ resource "aws_iam_role_policy_attachment" "default_permissions" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "prod-prod-comentarios-api-db-provisioner-db-provisioner"
    }

  # module.db_provisioner.aws_iam_role_policy_attachment.vpc_access[0] will be created
+ resource "aws_iam_role_policy_attachment" "vpc_access" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaVPCAccessExecutionRole"
      + role       = "prod-prod-comentarios-api-db-provisioner-db-provisioner"
    }

  # module.db_provisioner.aws_lambda_alias.default[0] will be created
+ resource "aws_lambda_alias" "default" {
      + arn              = (known after apply)
      + description      = "Use latest version as default"
      + function_name    = "prod-prod-comentarios-api-db-provisioner-db-provisioner"
      + function_version = "$LATEST"
      + id               = (known after apply)
      + invoke_arn       = (known after apply)
      + name             = "default"
    }

  # module.db_provisioner.aws_lambda_function.default[0] will be created
+ resource "aws_lambda_function" "default" {
      + arn                            = (known after apply)
      + description                    = "Provisions database [comentarios-api] in RDS Instance [comentarios-api-production-rds01]"
      + filename                       = ".terraform/modules/db_provisioner/packaged/rds-lambda-db-provisioner.zip"
      + function_name                  = "prod-prod-comentarios-api-db-provisioner-db-provisioner"
      + handler                        = "main.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 256
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "6yEEy6aGPkvyM7h5O+Ohp4ri1e3toBBco6LkjNZCVqg="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Attributes" = "db-provisioner"
          + "Name"       = "prod-prod-comentarios-api-db-provisioner-db-provisioner"
          + "Namespace"  = "prod"
          + "Stage"      = "prod"
        }
      + tags_all                       = {
          + "Attributes" = "db-provisioner"
          + "Name"       = "prod-prod-comentarios-api-db-provisioner-db-provisioner"
          + "Namespace"  = "prod"
          + "Stage"      = "prod"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "DB_INSTANCE_ID"               = "comentarios-api-production-rds01"
              + "DB_MASTER_PASSWORD_SSM_PARAM" = "/mysql/password"
              + "PROVISION_DB_NAME"            = "comentarios-api"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = (known after apply)
          + subnet_ids         = [
              + "subnet-08610eec2f5291688",
              + "subnet-0a128096a921e27ba",
            ]
          + vpc_id             = (known after apply)
        }
    }

  # module.db_provisioner.aws_security_group.default[0] will be created
+ resource "aws_security_group" "default" {
      + arn                    = (known after apply)
      + description            = "Controls access of Lambda DB Provisioner function [prod-prod-comentarios-api-db-provisioner-db-provisioner] to VPC resources"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "prod-prod-comentarios-api-db-provisioner-db-provisioner"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Attributes" = "db-provisioner"
          + "Name"       = "prod-prod-comentarios-api-db-provisioner-db-provisioner"
          + "Namespace"  = "prod"
          + "Stage"      = "prod"
        }
      + tags_all               = {
          + "Attributes" = "db-provisioner"
          + "Name"       = "prod-prod-comentarios-api-db-provisioner-db-provisioner"
          + "Namespace"  = "prod"
          + "Stage"      = "prod"
        }
      + vpc_id                 = "vpc-0c776cafe58b4328b"
    }

  # module.db_provisioner.aws_security_group_rule.egress_blocks[0] will be created
+ resource "aws_security_group_rule" "egress_blocks" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow all egress traffic to specified CIRD blocks"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "egress"
    }

  # module.db_provisioner.aws_security_group_rule.egress_from_lambda_to_db_instance[0] will be created
+ resource "aws_security_group_rule" "egress_from_lambda_to_db_instance" {
      + description              = "Allow outbound traffic from Lambda to DB Instance"
      + from_port                = 3306
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-014ac24e2e3545e4e"
      + to_port                  = 3306
      + type                     = "egress"
    }

  # module.db_provisioner.aws_security_group_rule.ingress_to_db_instance_from_lambda[0] will be created
+ resource "aws_security_group_rule" "ingress_to_db_instance_from_lambda" {
      + description              = "Allow inbound traffic to DB Instance from Lambda"
      + from_port                = 3306
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-014ac24e2e3545e4e"
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 3306
      + type                     = "ingress"
    }

Plan: 13 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.weploy.com.br/lock?id=alsofer%252Fcomentarios-api-infra%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>
Plan: 13 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
